[
    {
        "category": 0,
        "category_text": "account features available",
        "possibility": 1,
        "sentences": [
            "Users can create an account using a valid email address.",
            "Account holders can update their personal information anytime.",
            "A registered account can access the user dashboard.",
            "You can change your password through account settings.",
            "Two-factor authentication is available for all users.",
            "Users can delete their account from the profile page.",
            "An account allows access to all subscription options.",
            "It is possible to reset your password via email or SMS.",
            "Each account has access to billing and usage details.",
            "Users may link a payment method to their account.",
            "The platform allows profile picture uploads for all accounts.",
            "Account verification can be completed by email confirmation.",
            "Users can add a backup phone number to their account.",
            "The login page supports username or email login options.",
            "Accounts include access to real-time activity logs.",
            "It is possible to export personal data from your account.",
            "Users may view past login timestamps in the security tab.",
            "All users can edit their notification preferences.",
            "A mobile device can be paired with your account for extra security.",
            "Multiple devices can stay logged into the same account.",
            "Accounts can be upgraded to a business profile.",
            "Language and time zone settings can be updated from your account.",
            "You may enable dark mode from the account settings.",
            "Your account includes access to referral program tracking.",
            "Users can download a copy of their account information.",
            "You may opt in or out of promotional emails from your account.",
            "An active account is needed to access premium features.",
            "All accounts come with basic cloud storage access.",
            "You can enable or disable biometric login on your account.",
            "Each user account includes a security questions option.",
            "Support tickets can be submitted directly through your account.",
            "Billing history is visible from the account billing section.",
            "Users can save delivery addresses in their account.",
            "Custom preferences can be saved per account.",
            "An account allows access to early beta features if enabled.",
            "You can deactivate your account temporarily from the menu.",
            "Account avatars can be uploaded in PNG or JPG format.",
            "A user can review recent support interactions via their account.",
            "You can edit the profile name and email.",
            "An account is needed to subscribe.",
            "You can request to change information can name, age, identity details",
            "You need to use the sign up page from the home page to create an account"
        ]
    },
    {
        "category": 1,
        "category_text": "account features unavailable",
        "possibility": 0,
        "sentences": [
            "You cannot create an account without a valid email address.",
            "Users are not allowed to have multiple accounts with the same phone number.",
            "The system does not support deleting an account without email confirmation.",
            "Unverified accounts cannot access premium features.",
            "You cannot change your username once it is verified.",
            "Accounts cannot be shared between multiple users.",
            "It is not possible to log in with social media credentials.",
            "Users cannot pause their account indefinitely.",
            "The platform does not support temporary account creation.",
            "Account types cannot be changed once selected.",
            "Unverified users are restricted from editing billing information.",
            "It is not allowed to bypass the verification process.",
            "Users cannot transfer their account data to another user.",
            "It is not possible to merge two separate accounts into one.",
            "Deactivated accounts cannot be reactivated without support assistance.",
            "Accounts with ongoing subscriptions cannot be deleted immediately.",
            "There is no option to disable two-factor authentication once activated.",
            "You cannot recover an account after it’s been permanently deleted.",
            "Changing your email address does not skip the verification step.",
            "Multiple users cannot log in using the same account credentials.",
            "The platform does not support guest access to account settings.",
            "You cannot create more than one business profile per account.",
            "There is no support for registering with disposable email addresses.",
            "It is not possible to schedule automatic account deletion.",
            "Unverified accounts cannot submit support tickets.",
            "Accounts with policy violations are not eligible for appeal.",
            "It is not allowed to downgrade an enterprise account to free tier.",
            "Profile information cannot be hidden from the account admin.",
            "Accounts created outside supported regions will not be accepted.",
            "There is no way to recover account history after deletion.",
            "It is not permitted to remove security logs from your account.",
            "The system does not support changing the account creation date.",
            "Inactive accounts cannot be extended past 90 days.",
            "Your account cannot be accessed from restricted countries.",
            "There is no option to use emojis in your username.",
            "You cannot undo account deletion once it has been submitted.",
            "Changing your country requires creating a new account.",
            "There is no support for real-time account tracking outside the platform.",
            "The platform does not allow anonymous browsing with a logged-in account.",
            "You cannot assign admin rights to non-verified users.",
            "You cannot directly edit the profile identity details.",
            "You cannot use the same emil to create another account."
        ]
    },
    {
        "category": 2,
        "category_text": "subscription feature available",
        "possibility": 1,
        "sentences": [
            "Users can subscribe to the starter plan to access basic features.",
            "The ultra subscription includes additional tools and insights.",
            "Premium users gain access to priority support and exclusive content.",
            "You can upgrade your current plan to ultra or premium anytime.",
            "The subscription system lets users manage and renew services easily.",
            "Starter subscriptions are ideal for first-time users.",
            "An active subscription allows uninterrupted service usage.",
            "You can change your subscription tier at any time.",
            "The platform supports monthly and yearly subscription cycles.",
            "Users are allowed to view detailed subscription usage history.",
            "Each subscription comes with a customizable dashboard.",
            "You can set automatic renewal for your current subscription.",
            "The ultra plan includes analytics and advanced controls.",
            "A subscription is required to unlock advanced integrations.",
            "Premium users can invite team members to their subscription workspace.",
            "You can cancel and resubscribe to any plan without penalty.",
            "Each plan offers a different level of cloud storage access.",
            "The subscription menu shows your current billing period.",
            "You can trial the ultra plan before committing to it.",
            "Subscription-based features are listed under the service tab.",
            "You may receive alerts before your subscription renews.",
            "Upgrading your plan will not interrupt ongoing service.",
            "Starter plans include access to basic customer support.",
            "Your subscription level determines access to certain tools.",
            "The billing section shows your active subscription plan.",
            "Ultra and premium plans offer higher service quotas.",
            "You can use the platform immediately after subscribing.",
            "Multiple services can be managed under a single subscription.",
            "The platform allows pausing subscriptions for one billing cycle.",
            "You can view feature comparisons between subscription tiers.",
            "Users may earn rewards through subscription loyalty programs.",
            "All plans are eligible for promotional discounts when available.",
            "You can receive invoice copies for your subscription via email.",
            "An active subscription ensures access to all platform updates.",
            "Premium users can schedule 1-on-1 onboarding calls.",
            "Your subscription plan affects the response time for support tickets.",
            "Users may switch back to the starter plan after downgrading.",
            "Subscription receipts are downloadable from the account section.",
            "The platform supports gifting a subscription to another user.",
            "You can preview what features come with each subscription tier."
        ]
    },
    {
        "category": 3,
        "category_text": "subscription feature unavailable",
        "possibility": 0,
        "sentences": [
            "Users cannot subscribe to more than one plan at the same time.",
            "It is not possible to gift a subscription to someone without an account.",
            "The platform does not support auto-renewal cancellation by email request.",
            "You cannot upgrade to premium without first subscribing to starter or ultra.",
            "Subscription changes cannot be scheduled for future dates.",
            "It is not allowed to share one subscription across multiple accounts.",
            "There is no support for lifetime subscriptions at this time.",
            "Users cannot pause their subscription for more than one billing cycle.",
            "It is not possible to downgrade while the current cycle is active.",
            "Subscriptions cannot be extended manually by the user.",
            "You cannot access premium features with a starter plan.",
            "Subscription refunds are not processed automatically.",
            "There is no option to delay the subscription start date.",
            "You cannot split a single subscription across team members.",
            "It is not allowed to transfer a subscription between users.",
            "There is no free trial available for the premium plan.",
            "Users cannot subscribe to multiple tiers simultaneously.",
            "There is no support for region-based subscription pricing.",
            "The subscription cannot be paused mid-cycle without losing access.",
            "You cannot subscribe using gift cards or store credit.",
            "It is not possible to customize subscription feature sets.",
            "Expired subscriptions cannot be reactivated without payment.",
            "You cannot subscribe through third-party platforms.",
            "There is no way to convert a subscription into a one-time payment.",
            "You cannot adjust billing dates on an active subscription.",
            "Users cannot stack discounts on existing subscriptions.",
            "There is no way to change the plan mid-cycle without cancellation.",
            "The system does not allow partial refunds on unused time.",
            "There is no mobile-only subscription plan available.",
            "Subscription plans cannot be hidden from the billing page.",
            "You cannot access ultra features without subscribing to ultra.",
            "It is not allowed to skip the first payment cycle.",
            "Users cannot mix features from multiple subscription tiers.",
            "The platform does not support subscription-based guest access.",
            "You cannot reactivate a subscription that was canceled over 30 days ago.",
            "There is no downgrade grace period once a plan is canceled.",
            "The billing cycle cannot be changed after the plan is selected.",
            "Users cannot subscribe with incomplete profile information.",
            "The platform does not support auto-upgrade based on usage.",
            "You cannot downgrade to a free plan while under contract."
        ]
    },
    {
        "category": 4,
        "category_text": "payment feature available",
        "possibility": 1,
        "sentences": [
            "Users can add a credit or debit card to their account.",
            "The platform accepts payments through PayPal.",
            "You can download monthly invoices from the billing section.",
            "Billing history is visible in the account dashboard.",
            "Users can update their saved payment methods anytime.",
            "The system supports automatic monthly billing.",
            "You can change your billing address through account settings.",
            "Payment receipts are sent to the registered email.",
            "Users can apply promotional codes during checkout.",
            "The platform allows upgrading your billing tier at any time.",
            "All transactions are processed securely with encryption.",
            "You can preview upcoming billing dates and amounts.",
            "Refunds are issued within 3 to 5 business days when eligible.",
            "Users can switch between monthly and yearly payment options.",
            "The platform supports invoice-based billing for premium users.",
            "Billing notifications are sent before auto-renewal.",
            "You can add multiple payment methods to one account.",
            "Users may assign a default card for recurring payments.",
            "Receipts are downloadable as PDF files.",
            "You may request a copy of any past transaction.",
            "Your billing frequency can be changed from the subscription page.",
            "The system provides real-time status of recent payments.",
            "Users can review tax information on their invoices.",
            "You are allowed to disable auto-renewal from billing settings.",
            "Late payment reminders are sent automatically.",
            "You can cancel a payment if it’s still pending.",
            "Users can activate billing alerts via SMS or email.",
            "The platform offers grace periods for failed payments.",
            "All payment methods are verified before processing.",
            "Invoices can include business tax information on request.",
            "Refund status can be tracked in real time.",
            "Billing is synced across all user devices.",
            "You may receive billing summaries at the end of each cycle.",
            "Company accounts can request bulk payment options.",
            "Subscription fees are displayed clearly during checkout.",
            "You can choose to pay in your local currency.",
            "The billing portal is accessible from both mobile and web.",
            "Users may configure billing contacts for team accounts.",
            "Recurring payments can be paused from the dashboard.",
            "Payment confirmation is provided instantly after success."
          ]
    },
    {
        "category": 5,
        "category_text": "payment feature unavailable",
        "possibility": 0,
        "sentences": [
            "The platform does not support payments using cryptocurrency.",
            "Users cannot split payments between multiple cards.",
            "It is not possible to modify an invoice after it's issued.",
            "There is no option to pay with cash or money orders.",
            "You cannot request a refund after 14 days of payment.",
            "The system does not allow manual adjustment of taxes.",
            "Users cannot share billing accounts across profiles.",
            "You cannot apply more than one promo code per transaction.",
            "Billing data cannot be exported in spreadsheet format.",
            "There is no support for installment-based payments.",
            "You cannot assign payment roles to non-admin users.",
            "Users cannot pause billing once the cycle begins.",
            "There is no offline mode for billing portal access.",
            "You cannot reverse a completed transaction.",
            "Refunds are not provided for partial subscription periods.",
            "There is no billing support available on weekends.",
            "Users cannot link foreign bank accounts to billing.",
            "The platform does not support recurring billing outside supported regions.",
            "You cannot switch billing currency after subscription starts.",
            "It is not possible to set billing limits per user.",
            "Invoices cannot be grouped under different departments.",
            "You cannot make payments using loyalty points.",
            "The system does not support batch refunds.",
            "You cannot delay your payment due date manually.",
            "Billing summaries are not sent via postal mail.",
            "The platform does not support dynamic pricing in billing.",
            "You cannot use your account balance for payments.",
            "There is no option to pay for multiple users in one invoice.",
            "It is not allowed to disable billing notifications.",
            "Users cannot change the name on an invoice after payment.",
            "The billing cycle cannot be synced to a custom date.",
            "You cannot create multiple billing profiles per user.",
            "There is no feature to split subscription costs between accounts.",
            "Payment gateway choice cannot be customized by the user.",
            "You cannot request same-day invoice processing.",
            "Refunds are not instant even if canceled on the same day.",
            "The platform does not support donation-based billing models.",
            "You cannot change your billing region without re-registering.",
            "Users cannot remove tax calculation from their invoices.",
            "The system does not support zero-dollar transactions."
          ]
    }
]